article/lang/glib-hashtable.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>GHashTable使用</title>
<!-- 2016-12-05 Mon 16:17 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="[[mailto:pengwenbin7@126.com][pengwenbin7]]pengwenbin7" />
<meta name="viewport" content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
<link href="https://cdn.bootcss.com/bootstrap/3.3.6/css/bootstrap.min.css" rel="stylesheet">
<link rel="stylesheet" href="https://pengwenbin7.github.io/static/css/article.css">
</head>
<body>
<div id="content">
<h1 class="title">GHashTable使用</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 创建与销毁</a></li>
<li><a href="#sec-2">2. 增删改查</a></li>
<li><a href="#sec-3">3. 遍历</a></li>
</ul>
</div>
</div>
<p>
<a href="https://developer.gnome.org/glib/stable/glib-Hash-Tables.html">GHashTable文档</a>
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 创建与销毁</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #74af68;">// </span><span style="color: #74af68;">&#26032;&#24314;&#19968;&#20010;&#38190;&#21644;&#20540;&#37117;&#26159;&#23383;&#31526;&#20018;&#30340;hash&#34920;</span>
<span style="color: #34cae2;">GHashTable</span> *<span style="color: #dbdb95;">table</span> = g_hash_table_new(g_str_hash, g_str_equal); 
<span style="color: #74af68;">// </span><span style="color: #74af68;">&#38144;&#27585;&#19968;&#20010;hash&#34920;</span>
g_hash_table_destroy(table);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 增删改查</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #74af68;">// </span><span style="color: #74af68;">&#25554;&#20837;&#19968;&#20010;&#38190;&#20540;&#23545;</span>
<span style="color: #34cae2;">gboolean</span> <span style="color: #dbdb95;">pInsert</span> = g_hash_table_insert(table, <span style="color: #e67128;">"key"</span>, <span style="color: #e67128;">"value"</span>);
<span style="color: #74af68;">// </span><span style="color: #74af68;">&#35835;&#19968;&#20010;&#38190;&#30340;&#20540;</span>
<span style="color: #34cae2;">void</span> *<span style="color: #dbdb95;">value</span> = g_hash_table_lookup(table, <span style="color: #e67128;">"key"</span>);
<span style="color: #74af68;">// </span><span style="color: #74af68;">&#35835;&#25152;&#26377;&#38190;</span>
<span style="color: #34cae2;">GList</span> *<span style="color: #dbdb95;">keys</span> = g_hash_table_keys(table);
<span style="color: #74af68;">// </span><span style="color: #74af68;">&#35835;&#25152;&#26377;&#20540;</span>
<span style="color: #34cae2;">GList</span> *<span style="color: #dbdb95;">values</span> = g_hash_table_values(table);
<span style="color: #74af68;">// </span><span style="color: #74af68;">&#21024;&#38500;&#19968;&#20010;&#38190;&#20540;&#23545;</span>
<span style="color: #34cae2;">gboolean</span> <span style="color: #dbdb95;">pRm</span> = g_hash_table_remove(table, <span style="color: #e67128;">"key"</span>);
<span style="color: #74af68;">// </span><span style="color: #74af68;">&#21024;&#38500;&#25152;&#26377;&#38190;&#20540;&#23545;&#65292;&#36820;&#22238;void</span>
g_hash_table_remove_all(table);
<span style="color: #74af68;">// </span><span style="color: #74af68;">&#25554;&#20837;&#38190;&#12289;&#20540;&#30456;&#31561;&#30340;&#38190;&#20540;&#23545;&#65288;&#27492;&#26102;HashTable&#34920;&#29616;&#20986;List&#30340;&#34892;&#20026;&#65289;</span>
<span style="color: #34cae2;">gboolean</span> <span style="color: #dbdb95;">pAdd</span> = g_hash_table_add(table, <span style="color: #e67128;">"li"</span>);
<span style="color: #74af68;">// </span><span style="color: #74af68;">&#20462;&#25913;&#19968;&#20010;&#38190;&#23545;&#24212;&#30340;&#20540;</span>
<span style="color: #34cae2;">gboolean</span> <span style="color: #dbdb95;">pReplace</span> = g_hash_table_replace(talbe, <span style="color: #e67128;">"key"</span>, <span style="color: #e67128;">"value2"</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 遍历</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #74af68;">// </span><span style="color: #74af68;">&#22238;&#35843;&#20989;&#25968;&#65292;data&#26159;&#20256;&#36882;&#21040;g_hash_table_foreach()&#30340;&#20540;</span>
<span style="color: #34cae2;">void</span> <span style="color: #00ede1; font-weight: bold;">func</span>(<span style="color: #34cae2;">gpointer</span> <span style="color: #dbdb95;">key</span>, <span style="color: #34cae2;">gpointer</span> <span style="color: #dbdb95;">value</span>, <span style="color: #34cae2;">gpointer</span> <span style="color: #dbdb95;">data</span>)
{
    printf(<span style="color: #e67128;">"%s: %s"</span>, (<span style="color: #34cae2;">char</span> *) key, (<span style="color: #34cae2;">char</span> *) value);
}
<span style="color: #74af68;">// </span><span style="color: #74af68;">&#23545;&#27599;&#19968;&#20010;&#38190;&#20540;&#23545;&#25191;&#34892;&#22238;&#35843;&#20989;&#25968;func</span>
g_hash_table_foreach(table, func, <span style="color: #008b8b;">NULL</span>);
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: <a href="mailto:pengwenbin7@126.com">pengwenbin7</a></p>
<p class="date">Created: 2016-12-05 Mon 16:17</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
